---
type: CombinableElementArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# CombinableElementArray

`Autodesk.Revit.DB.CombinableElementArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CombinableElementArray | — | `public CombinableElementArray ()` |
| Method | Append | — | `public virtual void Append ( CombinableElement item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual CombinableElementArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( CombinableElement item , int index )` |
| Method | ReverseIterator | — | `public virtual CombinableElementArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual CombinableElement this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |